In [1]:
import pandas as pd 
import numpy as np

In [24]:
tees = pd.read_excel('data/River_Tees_daily_and_monthly_fish_counts.xlsx', sheet_name='Monthly_counts', skiprows=3).drop('Total', axis=1)[:13]

In [25]:
wear = pd.read_excel('data/River_Wear_daily_and_monthly_fish_counts.xlsx', sheet_name='Monthly_counts_combined', skiprows=3).drop('Total', axis=1)[:30]

In [26]:
tyne = pd.read_excel('data/River_Tyne_daily_and_monthly_fish_counts.xlsx', sheet_name='Monthly_counts', skiprows=3).drop('Total', axis=1)[:28]

In [43]:
def make_series(data):
    data = data.apply(pd.to_numeric, errors='coerce')
    data = pd.melt(data, id_vars=["Year"], var_name="Month", value_name = "Count")
    data['Month'] = data.Month + " " + data.Year.map(str)
    data = data.drop('Year', axis=1)
    data["Month"] = pd.to_datetime(data.Month, format="%b %Y", dayfirst=True)
    #data = data.sort("Month")
    data = data.set_index("Month")
    return data

In [47]:
tyne_series = make_series(tyne)
tees_series = make_series(tees)
wear_series = make_series(wear)

In [51]:
all_rivers = tyne_series.join(tees_series, lsuffix='_tyne', rsuffix='_tees').join(wear_series, lsuffix='', rsuffix='_wear')

In [54]:
all_rivers.sort_index(inplace=True)

In [59]:
all_rivers = pd.melt(all_rivers.reset_index(), id_vars=["Month"], var_name="River", value_name = "Count")
all_rivers = all_rivers.replace('Count', 'Wear').replace('Count_tyne', 'Tyne').replace('Count_tees', 'Tees')

/var/folders/7k/cr48jnws21q3gbkzbfqkhg000000gp/T/ipykernel_4053/1554720463.py:1: FutureWarning:

This dataframe has a column name that matches the 'value_name' column name of the resulting Dataframe. In the future this will raise an error, please set the 'value_name' parameter of DataFrame.melt to a unique name.

In [60]:
all_rivers

          Month River  Count
0    1996-01-01  Tyne    NaN
1    1996-02-01  Tyne    NaN
2    1996-03-01  Tyne    NaN
3    1996-04-01  Tyne    NaN
4    1996-05-01  Tyne    NaN
...         ...   ...    ...
1003 2023-08-01  Wear    NaN
1004 2023-09-01  Wear    NaN
1005 2023-10-01  Wear    NaN
1006 2023-11-01  Wear    NaN
1007 2023-12-01  Wear    NaN

[1008 rows x 3 columns]

In [61]:
all_rivers.to_csv('data/natural_water_fish.csv')